<template>
  <v-row>
    <v-col >
      <v-card outlined>
        <v-card-title class="info--text font-weight-light">
          <h2 class="font-weight-light">Объявление</h2>
        </v-card-title>
        <v-divider  class="ma-2"></v-divider>
        <v-card-text>
          <b>Автошкола объявляет набор слушателей на курсы профессиональной подготовки водителей категории "В" на ОКТЯБРЬ с 01.10.2019 года.</b>
        </v-card-text>
        <v-card-text>Дни занятий по теории:</v-card-text>
        <v-container>
          <ul>
            <li>Вторник (с 18:15 до 21:00)</li>
            <li>Четверг (с 18:15 до 21:00)</li>
          </ul>
        </v-container>
        <v-card-text>График вождения устанавливается индивидуально.</v-card-text>
        <v-card-text>
          Стоимость обучения за весь курс обучения:
          <b>24 000</b> рублей
        </v-card-text>
        <v-card-text>
          Более подробную информацию можно получить по телефону:
          <b>+7(495) 792-83-02</b>
        </v-card-text>
        <v-divider class="ma-2"></v-divider>
        <center>
          <a
            href="https://mpt.ru/avtoshkola/files/заключение гаи.pdf"
          >Заключение Управления ГИБДД ГУ МВД России по г. Москве</a>
        </center>
        <v-divider class="ma-2"></v-divider>
        <v-card-title class="info--text font-weight-light">
          <h2
            class="font-weight-light"
          >Программа профессионального обучения "Подготовка водителей транспортных средств категории В"</h2>
        </v-card-title>
        <v-divider class="ma-2"></v-divider>
        <v-card-text>Преимуществом автошколы является работа опытных сотрудников – профессионалов, а так же реализована своя площадка в 30 метрах от учебного класса – автоподготовки. Обучение в городе происходит около здания.</v-card-text>
        <v-card-text>В результате обучения вы получите грамотные наставления учителей и мастеров производственного обучения. Так же вас научат теоретическим и практическим навыкам вождения в городском режиме.</v-card-text>
        <v-card-text>На основании полученных навыков вы получаете номерной сертификат об окончании автошколы.</v-card-text>
        <v-card-title class="info--text font-weight-light">ОБУЧАЮЩАЯ ПРОГРАММА И ЦЕНА</v-card-title>
        <v-container>
          <ul>
            <li>Общее кол-во часов по программе составляет 188 (автоматическая трансмиссия)/190 (Механическая трансмиссия) часов, из них практика 54 (автоматическая трансмиссия)/56 (механическая трансмиссия) часов практика;</li>
            <li>Сроки обучения составляют 3,0 - 3,5 месяца;</li>
            <li>Стоимость обучения 24 000 рублей с возможностью поблочной оплаты. Дополнительные занятия помимо базовых практических часов стоят 1500 Р. и составляют 2 академических часа;</li>
            <li>Возможность приобрести комплект литературы;</li>
            <li>Предоставление медицинской комиссии;</li>
            <li>После прохождения обучения по данной учебной программе сдача экзамена в ГИБДД не составит для Вас проблем;</li>
            <li>Наш опыт работы более 19 лет и мы выработали свою специфику работы с каждым слушателем;</li>
            <li>Остались вопросы? У нас есть недорогие дополнительные занятия помимо базовых практических часов.</li>
          </ul>
        </v-container>
        <v-divider class="ma-2"></v-divider>
        <v-card-title class="info--text font-weight-light">ПОДГОТОВКА ОСУЩЕСТВЛЯЕТСЯ В ОБЛАСТИ</v-card-title>
        <v-container>
          <ul>
            <li>Правил дорожного движения Российской Федерации;</li>
            <li>Основных положений по допуску транспортных средств к эксплуатации и обязанностей должностных лиц по обеспечению безопасности дорожного движения;</li>
            <li>Законодательства Российской Федерации в части, касающейся обеспечения безопасности дорожного движения, а также уголовной, административной и иной ответственности водителей транспортных средств;</li>
            <li>Технических аспектов безопасного управления транспортным средством;</li>
            <li>Факторов, способствующих возникновению дорожно-транспортных происшествий;</li>
            <li>Элементов конструкции транспортного средства, состояние которых влияет на безопасность дорожного движения;</li>
            <li>Методов оказания первой помощи лицам, пострадавшим при дорожно-транспортном происшествии.</li>
          </ul>
        </v-container>
        <v-divider class="ma-2"></v-divider>
        <v-card-title class="info--text font-weight-light">ПРАКТИКА</v-card-title>
        <v-card-text>Курсы автовождения проводят спокойные, опытные, понимающие, адекватные автоинструктора. Как мужчины, так и женщины с большим стажем работы.</v-card-text>
        <v-card-text>Наши авто оснащены вторыми педалями и зеркалами, что позволяет контролировать процесс вождения. Обучение проводятся индивидуально для каждого ученика, как на механической коробке переключения передач, так и на «автомате».</v-card-text>
        <v-card-text>С учетом новой дорожной обстановки и интенсивности транспортных потоков в городе, в корне, изменилось обучение безопасному управлению автомобилем.</v-card-text>
        <v-card-text>Получение водительских прав – это только первый шаг на пути к захватывающему миру управлением автомобилем.</v-card-text>
      </v-card>
    </v-col>
  </v-row>
</template>