<?php

use Illuminate\Database\Seeder;
use App\Models\Group;

class ScheduleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $les = array('Teacher'=>null,'Lesson'=>null);//Формат одной пары
        $les0 = array('Teacher'=>'Горбунов Антон Дмитриевич','Lesson'=>'Операционные системы');//Формат одной не пустой пары
        $les1 = array('Teacher'=>array('Горбунов Антон Дмитриевич', 'Токарчук Александр Сергеевич'),'Lesson'=>array('Операционные системы', 'Информационные системы и технологии'));//Формат числителя и знаменателя пары
        $les2 = array('Teacher'=>array(array('Горбунов Антон Дмитриевич', 'Токарчук Александр Сергеевич'), null),'Lesson'=>array(array('Информационные системы и технологии','Информационные системы и технологии'), null));//Формат сдвоенных пары
        $les3 = array('Teacher'=>array(array('Горбунов Антон Дмитриевич', 'Токарчук Александр Сергеевич'), array('Токарчук Александр Сергеевич', 'Горбунов Антон Дмитриевич')),'Lesson'=>array(array('Информационные системы и технологии','Информационные системы и технологии'), array('Информационные системы и технологии','Информационные системы и технологии')));//Формат сдвоенных не пустых пар
        $les4 = array('Teacher'=>array(array('Горбунов Антон Дмитриевич', 'Токарчук Александр Сергеевич'), 'Токарчук Александр Сергеевич'),'Lesson'=>array(array('Информационные системы и технологии','Информационные системы и технологии'), 'Информационные системы и технологии'));//Формат сдвоенных не пустых пар
        $les5 = array('Teacher'=>array(null, 'Токарчук Александр Сергеевич'),'Lesson'=>array(null, 'Информационные системы и технологии'));//Формат числителя и знаменателя пары
        $les6 = array('Teacher'=>array('Горбунов Антон Дмитриевич', null),'Lesson'=>array('Операционные системы', null));//Формат числителя и знаменателя пары

        $lesons = array('Place'=>"1",'1'=>$les1,'2'=>$les2,'3'=>$les3,'4'=>$les4,'5'=>$les0,'6'=>$les5,'7'=>$les6,'8'=>$les);//Формат дня
        
        $rasp = array('Понедельник'=>$lesons,'Вторник'=>$lesons,'Среда'=>$lesons,'Четверг'=>$lesons,'Пятница'=>$lesons,'Суббота'=>$lesons);// Формат недели
        foreach (Group::get() as $group) {  
            DB::table("schedules")->insert(array('schedule'=>json_encode($rasp),'group_id'=>$group['id']));
        }
    }
}
