<template>
    <v-tabs light mobile-break-point="0" grow>
        <v-tab> Справка </v-tab>
        <v-tab> Характеристика </v-tab>
        <v-tab-item class="pa-4">
            <v-card outline>
                <v-system-bar color="info">
                    <small style="color: white;">Правила оформления заявки</small>
                </v-system-bar>
                <v-card-text>
                    <div>
                        <v-alert class="my-2" border="left" dense type="info">
                            <span class="white--text subtitle-1 ">Гербовая печать на справке в военкомат после получения справки в техникуме ставится студентом самостоятельно в РЭУ (Стремянный переулок, д. 36, корп. 5, 212 каб, с понедельника по пятницу с 8-30 до 17-00).</span>
                        </v-alert>
                        <v-alert class="my-2" border="left" dense type="info">
                            <span class="white--text subtitle-1 ">«По месту требования» справки не оформляются.</span>
                        </v-alert>
                    </div>
                    <div>
                        <v-alert class="my-2" border="left" dense color="primary" dark>
                            <span class="white--text subtitle-1 ">Срок подготовки справок до 3 рабочих дней, отсчет срока начинается со следующего рабочего дня (с понедельника по пятницу) после заказа справки.</span>
                        </v-alert>
                    </div>
                    <div class="mb-2">О готовности справки и об отказе приема заявки в работу уведомления отправляются на электронную почту студента, указанную в заявке, автоматически.</div>
                    <div><b>1 заявка = 1 справка</b> в одно место предоставления, если надо несколько справок в одно место писать кол-во штук. (Пример заявки если надо несколько штук: МФЦ – 2 шт).</div>
                    <div><b>Заказ справки на работу родителю или студенту</b> – писать «на работу родителя» или «по месту трудоустройства» без названия организации.</div>
                    <div><b>Заказ справки в гос. организации</b> – писать только название организации, запрещено писать в заявке для чего нужна справка и т.п. лишнюю информацию (пример заявки: ПФ). При необходимости отдельная заявка создается <b>для заказа лицензии, аккредитации.</b></div>
                    <div><b>Заказ справки в военкомат</b> – писать название военкомата, район, округ, город, область (пример заявки: Военкомат Бутовского района ЮЗАО г. Москва).</div>
                    <div class="pt-4"><span class="subtitle-1">Прием студентов ведется только по студенческому билету</span></div>
                    <div><b>- для студентов 1 курса: по адресу: ул. Нежинская, д. 7, кабинет 230</b> с понедельника по субботу по следующему расписанию работы со студентами: <b>с 11-40 до 12-00 и с 13-30 до 14-00;</b></div>
                    <div><b>- для студентов 2, 3, 4 и специальности 40.02.01: по адресу: ул. Нежинская, д. 7, кабинет 242</b> понедельник, вторник, четверг и пятница по расписанию работы со студентами: <b>с 11-40 до 12-00 и с 13-30 до 14-00.</b></div>
                    <div class="pt-4"><span class="subtitle-1">Канцелярия не занимается подготовкой следующих документов:</span></div>
                    <div><b>Справка о периоде обучения (выписка оценок) заказывается и получается: 1, 2, 3, 4 курсы</b> – заведующий отделением Ключник Н.Е. (тел. 8-926-919-23-46, Нежинская ул., д.7, каб 223).</div>
                    <div><b>Характеристика, анкета для военкомата заказывается и получается: 1 курс </b> – педагог организатор отделения (тел. 8-925-800-10-97, Нежинская ул., д.7, каб 230); 2, 3, 4 курс – заведующий отделением Руденко Т.В. (тел. 8-495-800-12-00 доб. 2054, Нежинская ул., д.7, каб 242).</div>
                    <div><b>Все справки с денежными суммами (о размере стипендии и т.п.), справка на субсидию</b> – в бухгалтерии (Стремянный пер, д. 36, корп.5, кабинеты 304 и 308, тел. для бюджета 8-495-958-26-17, для договора 8-499-237-94-77).</div>
                    <div><b>Копия аттестата</b> – в отделе по работе со студентами (Стремянный пер, д. 36, корп. 3, каб 100 (7 и 8 комн.) тел. 8-499-237-81-04).</div>
                </v-card-text>
            </v-card>
            <certificate></certificate>
        </v-tab-item>
        <v-tab-item class="pa-4">
            <characteristic></characteristic>
        </v-tab-item>
    </v-tabs>
</template>

<script>
import Certificate from "@/js/views/certificate-f/Certificate";
import Characteristic from "@/js/views/certificate-f/Characteristic";

export default {
    components: {
        certificate: Certificate,
        characteristic: Characteristic
    },
}
</script>