//? Документация к api ------------------------

//! Описание
// Api для работы с расписанием звонков для учебных мест проведения

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * call_schedule - JSON - not null
     * place_id - int - not null - FK
     */
    //*----------------------------------------
    //*----------------------------------------
    //!         Работа с данными
    //*----------------------------------------
    //*Редактирование расписания звонков
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //!----------------------------------------
    edit(callSchedule) 
    {
        return axios.post('/api/edit/callschedule', {'callSchedule': callSchedule})
        .then(() => {return true;})
        .catch(() => {return false;});
    },
    //*Получение расписания звонков
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //!----------------------------------------
    getCallSchedule() 
    {
        return axios.get('/api/getters/get_call_schedule')
        .then(res => {return res.data.timeTable;})
        .catch(() => {return undefined;});
    },
    //*Получение расписания звонков для панели
    //! Комментарий ---------------------------
    //? Реализуется получения данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //!----------------------------------------
    getCallScheduleForPanel() 
    {
        return axios.get('/api/getters/get_call_schedule_for_panel')
        .then(res => {return res.data.panel_array;})
        .catch(() => {return undefined;});
    }
}