//? Документация к api ------------------------

//! Описание
// Api для работы с расписанием звонков для учебных мест проведения

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * call_schedule - JSON - not null
     * place_id - int - not null - FK
     */
    //*----------------------------------------




    //*----------------------------------------
    //!         Работа с данными
    //*----------------------------------------
    //*Редактирование расписания звонков
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //! Отсутсвует
    //!----------------------------------------
    edit(callSchedule) {
        return axios.post('/api/edit/callschedule', {
            'callSchedule': callSchedule
        });
    }
}
