//? Документация к api ------------------------

//! Описание
// Api для работы с расписанием звонков для учебных мест проведения

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'
import withSnackbar from "@/js/components/mixins/withSnackbar";

export default {
    mixins: [withSnackbar],
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * call_schedule - JSON - not null
     * place_id - int - not null - FK
     */
    //*----------------------------------------




    //*----------------------------------------
    //!         Работа с данными
    //*----------------------------------------
    //*Редактирование расписания звонков
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //! Отсутсвует
    //!----------------------------------------
    edit(callSchedule) {
        axios.post('/api/edit/callschedule', {'callSchedule': callSchedule})
        .then(res => {return res.data.timeTable;})
        .catch(ex => {this.showError("Произошла ошибка при получении данных: " + ex);});
    },

    //*Получение расписания звонков
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //! Отсутсвует
    //!----------------------------------------
    getCallSchedule() {
        axios.get('/api/getters/get_call_schedule')
        .then(res => {return res.data.places;})
        .catch(ex => {this.showError("Ошибка получения данных: " + ex);});
    },

    //*Получение расписания звонков для панели
    //! Комментарий ---------------------------
    //? Реализуется получения данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //! Отсутсвует
    //!----------------------------------------
    getCallScheduleForPanel() {
        axios.get('/api/getters/get_call_schedule_for_panel')
        .then(res => {return res.data.panel_array;})
        .catch(ex => {this.showError('Ошибка получения данных: ' + ex);});
    }
}