//? Документация к api ------------------------

//! Описание
// Api для работы с расписанием звонков для учебных мест проведения

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * call_schedule - JSON - not null
     * place_id - int - not null - FK
     */
    //*----------------------------------------




    //*----------------------------------------
    //!         Работа с данными
    //*----------------------------------------
    //*Редактирование расписания звонков
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //! Отсутсвует
    //!----------------------------------------
    edit(callSchedule, _this) {
        return axios.post('/api/edit/callschedule', {'callSchedule': callSchedule})
        .then(res => {_this.showMessage("Выполнено!"); return res.data.timeTable;})
        .catch(ex => {_this.showError("Произошла ошибка выолнения!"); return undefined;});
    },

    //*Получение расписания звонков
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //! Отсутсвует
    //!----------------------------------------
    getCallSchedule(_this) {
        return axios.get('/api/getters/get_call_schedule')
        .then(res => { return res.data.timeTable;})
        .catch(ex => {_this.showError("Ошибка получения данных!"); return undefined;});
    },

    //*Получение расписания звонков для панели
    //! Комментарий ---------------------------
    //? Реализуется получения данных в таблицe *CALLSHEDULE* (Расписание звонков)
    //! Требование ----------------------------
    //! Отсутсвует
    //!----------------------------------------
    getCallScheduleForPanel(_this) {
        return axios.get('/api/getters/get_call_schedule_for_panel')
        .then(res => {return res.data.panel_array;})
        .catch(ex => {_this.showError("Ошибка получения данных!"); return undefined;});
    }
}