//? Документация к api ------------------------

//! Описание
// Api для заказа документов

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * call_schedule - JSON - not null
     * place_id - int - not null - FK
     */
    //*----------------------------------------




    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение справок
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *CERTIFICATES* (Справки)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //!----------------------------------------
    getCertificates(_this) {
        return axios.get('/api/getters/get_certificates')
        .then(res => {return res.data.certificates;})
        .catch(ex => {return undefined;});
    },




    //*----------------------------------------
    //!         Работа с данными*
    //*---------Имеется модификация------------
    //*Заказ нового документа
    //! Комментарий ---------------------------
    //? Реализуется сохранения данных в таблице *CERTIFICATES* (Справки)
    //! Требование ----------------------------
    //!----------------------------------------
    save(data) {
        return axios.post('/api/save/certificate/', {"data": data.data, "type": data.type})
        .then(res => {return true;})
        .catch(exp => {return false;});
    },

    //*Уведомление и фикусация о выполнении
    //*------------Модификация-----------------
    //! Комментарий ---------------------------
    //? Реализуется уведомление пользователя о готовности заказанного документа и занесение указателя в БД о готовности
    //! Требование ----------------------------
    //! Реализовать back-end для api 
    //!----------------------------------------
    sendEmailAccess(answer) {
        return axios.post('/api/functions/send_email_certificate_access/', answer)
        .then(result =>{return true;})
        .catch(ex => {return false;});
    },

    //*Ответ канцелярии заказчику, в случае если справку нельзя сделать, при том, что справка не будет зафиксирована о выполнении
    //*------------Модификация-----------------
    //! Комментарий ---------------------------
    //? Реализуется уведомление пользователя об отказе изготавить документ и занесение указателя в БД об отказе
    //! Требование ----------------------------
    //! Реализовать back-end для api 
    //!----------------------------------------
    sendEmailCancel(answer) {
        return axios.post('/api/functions/send_email_certificate_cancel/', answer)
        .then(result => {return true;})
        .catch(ex => {return false;});
    }
}