//? Документация к api ------------------------

//! Описание
// Api для работы с дисциплинами

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * 
     */
    //*----------------------------------------





    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение дисциплин
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *Discipline* (Пользователи)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //! Отсутсвуют
    //!----------------------------------------
    getDisciplines() {
        return axios.get('/api/getters/get_disciplines');
    },
}
