//? Документация к api ------------------------

//! Описание
// Api для работы с дисциплинами

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

//! Метод 
/**
 * 
 */

import axios from 'axios'
import withSnackbar from "@/js/components/mixins/withSnackbar";

export default {
    mixins: [withSnackbar],
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * 
     */
    //*----------------------------------------





    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение дисциплин
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *Discipline* (Пользователи)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //! Отсутсвуют
    //!----------------------------------------
    getDisciplines() {
        axios.get('/api/getters/get_disciplines')
        .then(res => {return res.data.disciplines;})
        .catch(ex => {this.showError("Произошла ошибка: " + ex);});
    },
}
