//? Документация к api ------------------------

//! Описание
// Api для работы с обратной связью системы

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'
import withSnackbar from "@/js/components/mixins/withSnackbar";

export default {
    mixins: [withSnackbar],
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * user_id - int - not null - FK
     * type - string - not null
     * text - string - not null
     * answered - int - not null
     */
    //*----------------------------------------




    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение обращений пользователей
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *FEEDBACK* (Обраная связь)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //! Отсутсвуют
    //!----------------------------------------
    getFeedbackRequests() {
        axios.get('/api/getters/get_feedback_requests')
        .then(res => {return res.data.feedback;})
        .catch(ex => {this.showError("Произошла ошибка: " + ex);});
    },




    //*----------------------------------------
    //!         Работа с данными*
    //*---------Имеется модификация------------
    //*Заказ нового документа
    //! Комментарий ---------------------------
    //? Реализуется сохранения данных в таблице *FEEDBACK* (Обраная связь)
    //! Требование ----------------------------
    //! Реализовать back-end для api 
    //!----------------------------------------
    save(data) {
        axios.post('/api/student/feedback/save', {"text": data.text, "type": data.type})
        .then(res => {this.showMessage("Ваше обращение будет рассмотрено в ближайшее время"); return true;})
        .catch(ex => {this.showError("Произошла ошибка: " + ex); return false;});
    },

    //*Оправка сообщений на почту
    //*------------Модификация-----------------
    //! Комментарий ---------------------------
    //? Реализуется отправка сообщения на почту пользователя в качестве ответа на обращение
    //! Требование ----------------------------
    //! Реализовать back-end для api 
    //!----------------------------------------
    sendEmail(data)
    {
        axios.post('/api/admin/request_users/send_email/' + data.id, {
            "text": data.text,
            "to": data.mail,
        })
        .then(result => {this.showMessage("Сообщение отправлено");return true;})
        .catch(ex => {this.showError("Произошла следующая ошибка! " + ex); return false;});
    },
}