//? Документация к api ------------------------

//! Описание
// Api для работы с обратной связью системы

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * user_id - int - not null - FK
     * type - string - not null
     * text - string - not null
     * answered - int - not null
     */
    //*----------------------------------------
    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение обращений пользователей
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *FEEDBACK* (Обраная связь)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //!----------------------------------------
    getFeedbackRequests() 
    {
        return axios.get('/api/getters/get_feedback_requests')
        .then(res => {return res.data.feedback;})
        .catch(() => {return undefined;});
    },
    //*----------------------------------------
    //!         Работа с данными*
    //*----------------------------------------
    //*Заказ нового документа
    //! Комментарий ---------------------------
    //? Реализуется сохранения данных в таблице *FEEDBACK* (Обраная связь)
    //! Требование ----------------------------
    //!----------------------------------------
    save(data) 
    {
        return axios.post('/api/save/feedback/', {"text": data.text, "type": data.type})
        .then(() => {return true;})
        .catch(() => {return false;});
    },
    //*Оправка сообщений на почту
    //*------------Модификация-----------------
    //! Комментарий ---------------------------
    //? Реализуется отправка сообщения на почту пользователя в качестве ответа на обращение
    //! Требование ----------------------------
    //!----------------------------------------
    sendEmail(data)
    {
        return axios.post('/api/functions/send_feedback_email_answer/', data)
        .then(() => {return true;})
        .catch(() => {return false;});
    },
}