//? Документация к api ------------------------

//! Описание
// Api для работы с новостной лентой

//! Таблицы базы данных
// NEWS

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * 
     */
    //*----------------------------------------




    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение последних 124-х постов
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *NEWS* (Новости)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //! Реализовать back-end для api
    //!----------------------------------------
    getNews(_this) {
        return axios.get('/api/getters/news')
        .then(result => {return result.data.news;})
        .catch(ex => {_this.showError("Ошибка получения данных!"); return false;});
    },


    
    
    //*Получение поста по id
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *NEWS* (Новости) в соответсвии с id
    //? Возвращается объект
    //! Требование ----------------------------
    //! Реализовать back-end для api
    //!----------------------------------------
    getNewsById(id, _this) {
        return axios.get('/api/getters/news_by_id/' + id)
        .then(result => {return true;})
        .catch(ex => {_this.showError("Ошибка получения данных!"); return false;});
    },




    //*----------------------------------------
    //!         Работа с данными
    //*----------------------------------------
    //*Добавление новой записи
    //! Комментарий ---------------------------
    //? Реализуется добавление данных в таблицу *NEWS* (Новости)
    //! Требование ----------------------------
    //! Реализовать back-end для api
    //!----------------------------------------
    insertNews(data, _this) {
        return axios.post('/api/save/news', data)
        .then(result => {_this.showMessage("Выполнено!"); return true;})
        .catch(ex => {_this.showError("Ошибка выполнения!"); return false;});
    },

    //*Редактирование записи
    //! Комментарий ---------------------------
    //? Реализуется редактирование данных в таблице *NEWS* (Новости)
    //! Требование ----------------------------
    //! Реализовать front
    //!----------------------------------------
    updateNews(data, _this) {
        return axios.post('/api/update/news', data)
        .then(result => {_this.showMessage("Выполнено!"); return true;})
        .catch(ex => {_this.showError("Ошибка выполнения!"); return false;});
    },

    //*Логическое удаление записи
    //! Комментарий ---------------------------
    //? Реализуется стирание данных в таблице *NEWS* (Новости) С ВОЗМОЖНОСТЬЮ ВОССТАНОВЛЕНИЯ
    //! Требование ----------------------------
    //! Реализовать back-end для api
    //!----------------------------------------
    deleteNews(id, _this) {
        return axios.post('/api/delete/news/' + id)
        .then(result => {_this.showMessage("Выполнено!"); return true;})
        .catch(ex => {_this.showError("Ошибка выполнения!"); return false;});
    },

    //*Оценка записи
    //! Комментарий ---------------------------
    //? Реализуется установка флага отметки новости
    //! Требование ----------------------------
    //! Реализовать back-end для api
    //!----------------------------------------
    likeNews(id, _this) {
        return axios.post('/api/update/set_like/' + id)
        .then(result => {_this.showMessage("Выполнено!"); return true;})
        .catch(ex => {_this.showError("Ошибка выполнения!"); return false;});
    },
}