//? Документация к api ------------------------

//! Описание
// Api для работы с расписанием экзаменов групп

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * info - JSON - not null
     * group_id - int - not null - FK
     */
    //*----------------------------------------


    //*----------------------------------------
    //!         Работа с данными
    //*----------------------------------------
    //*Сохранение расписания экзаменов
    //! Комментарий ---------------------------
    //? Реализуется сохранение  данных в таблице *SCHEDULES_EXAM* (Расписание экзаменов)
    //! Требование ----------------------------
    //!----------------------------------------
    saveScheduleExam(data, _this) {
        return axios.post('/api/save/scheduleExam/', data)
        .then(result => { _this.showMessage("Выполнено!"); return true; })
        .catch(exception => { _this.showError("Ошибка выполнения!"); return false; });
    }
}
