//? Документация к api ------------------------

//! Описание
// Api для работы со студентами

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * 
     */
    //*----------------------------------------
    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение студентов по id группы
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *USERS* (Пользователи) и *STUDENTS* (Студенты)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //!----------------------------------------
    getStudentsByGroupId(group_id) 
    {
        return axios.get('/api/getters/students_by_group_id/'+ group_id)
        .then(res => {return res.data.students;})
        .catch(() => {return undefined;});
    },
}