//? Документация к api ------------------------

//! Описание
// Api для работы со студентом системы

//! Таблицы базы данных
//

//! Метод 
/**
 * 
 */

//! Метод 
/**
 * 
 */

import axios from 'axios'

export default {
    //*----------------------------------------
    //!         Модель данных
    //*----------------------------------------
    /**
     * id - BIGINT
     * user_id - int - not null - FK
     * group_id - int - not null - FK
     * birthday - string - not null
     * gender - string - not null
     * type_of_financing - int - not null
     */
    //*----------------------------------------




    //*----------------------------------------
    //!         Получение данных
    //*----------------------------------------
    //*Получение всех студентов
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *STUDENTS* (Студенты)
    //? Возвращается полная таблица данных JSON формата
    //! Требование ----------------------------
    //! Реализовать back-end для api
    //!----------------------------------------
    getStudents() {
        return axios.get('/api/admin/user_management/get_users');
    },

    //*Получение студента
    //! Комментарий ---------------------------
    //? Реализуется получение данных из таблицы *STUDENTS* (Студенты)
    //? Возвращается экзмемпляр данных по id
    //! Требование ----------------------------
    //! Реализовать back-end для api
    //!----------------------------------------
    getStudent(student_id) {
        return axios.post('/api/admin/user_management/get_student/' + student_id);
    }
}
