<template lang="pug">
  v-layout.row.wrap
    c-specialtie(v-for="(item, index) in items" :key="index" :item="item")
</template>

<script>
import SpecialtiePage_C from "./components/C_SpecialtyPage";
export default {
  data: () => ({
    items: [
      {
        href: "https://mpt.ru/upload/iblock/bfe/1.jpg",
        title: "Программирование в компьютерных системах",
        text:
          "В цикле профессиональных дисциплин студенты изучают безопасность информационных систем, техническое обслуживание и ремонт компьютеров, администрирование сетей, диагностику и системное программирование, WEB-дизайн и графическое моделирование объектов."
      },
      {
        href:
          "https://mpt.ru/upload/iblock/33d/%D0%91%D0%B5%D0%B7%20%D0%B8%D0%BC%D0%B5%D0%BD%D0%B8-1.jpg",
        title: "Информационные системы (по отраслям)",
        text:
          "Студенты изучают функционирование вычислительных систем, операционные системы, компьютерные сети, метрологию, стандартизацию, сертификацию и техническое документоведение. Среди профессиональных модулей — эксплуатация и модификация информационных систем (куда входят методы и средства их проектирования), участие в разработке информационных систем."
      },
      {
        href: "https://mpt.ru/upload/iblock/886/1.jpg",
        title: "Прикладная информатика (по отраслям)",
        text:
          "Будущему технику-программисту нужно знать языки программирования, уметь создавать веб-страницы, владеть иностранным языком (английским как минимум). Студентов учат разрабатывать программы для различных целей и задач."
      },
      {
        href: "https://mpt.ru/upload/iblock/f65/3.jpg",
        title: "Право и организация социального обеспечения",
        text:
          "Важные предметы, которые предстоит изучить будущим юристам, — право социального обеспечения, финансовое, семейное, трудовое, экологическое, конституционное право, страховое дело, гражданский процесс."
      },
      {
        href: "https://mpt.ru/upload/iblock/88b/2.jpg",
        title: "Компьютерные сети",
        text:
          "Студенты изучают устройство и обслуживание локальных компьютерных сетей, установку и настройку аппаратных и программных средств доступа в сеть Интернет, информационную безопасность компьютеров и сетей, подключение и настройку сетевого оборудования, проведение диагностики и устранение неисправностей сетевого оборудования."
      },
      {
        href: "https://mpt.ru/upload/iblock/a16/4.jpg",
        title: "Информационная безопасность автоматизированных систем",
        text:
          "В профессиональном цикле дисциплин будущие специалисты по защите информации практикуются в языках программирования, проходят технологии и методы программирования, безопасность операционных систем и сетей."
      },
      {
        href:
          "https://mpt.ru/upload/iblock/aee/%D0%91%D0%B5%D0%B7%20%D0%B8%D0%BC%D0%B5%D0%BD%D0%B8-1.jpg",
        title: "Компьютерные системы и комплексы",
        text:
          "Программа обучения предусматривает изучение архитектуры ЭВМ, периферийных устройств, системного, прикладного ПО, микропроцессорных цифровых устройств, средств обеспечения информационной безопасности в компьютерных системах, принципов построения компьютерных сетей, администрирования Windows, Unix."
      }
    ]
  }),
  components: {
    "c-specialtie": SpecialtiePage_C
  }
};
</script>