<template>
  <v-row class="pa-6">
    <retraining 
      v-for="(item, index) in items"
      :key="index"
      :item="item"/>
    
  </v-row>
</template>

<script>
import Retraining from "./RetCom"
export default {
  data: () => ({
    items: [
      {
        href:
          "https://avatars.mds.yandex.net/get-zen_doc/1895227/pub_5cdc919cdee36d00b47e3b8b_5cdc91b81d586800b38792f5/scale_1200",
        title: "FrontEnd разработка и WEB-дизайн​",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.035 «Разработчик WEB и мультимедийных приложений». Вид профессиональной деятельности «Проектирование, разработка и интеграция информационных ресурсов в локальной сети и информационно-телекоммуникационной сети «Интернет»"
      },
      {
        href: "https://brandmaker.ru/statics/zapis/56387036b1fb8.jpg",
        title: "Разработка мобильных приложений",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.001 «Программист». Вид профессиональной деятельности «Разработка программного обеспечения»"
      },
      {
        href:
          "https://thecommunity.ru/uploads/posts/2018-05/1525723853_net.png",
        title: "Программирование на платформе .Net",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.001 «Программист». Вид профессиональной деятельности «Разработка программного обеспечения»"
      },
      {
        href:
          "https://i0.wp.com/academdpo.ru/wp-content/uploads/2018/03/sis_admin.jpg?zoom=2.625&resize=539%2C359",
        title:
          "Системное администрирование информационно-коммуникационных систем",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.026 «Специалист по администрированию сетевых устройств информационно-коммуникационных систем». Вид профессиональной деятельности «Администрирование информационно-коммуникационных (инфокоммуникационных) систем»"
      },
      {
        href:
          "https://techrocks.ru/wp-content/uploads/2019/01/learn-major-programming-languages-840x500.jpg",
        title: "BackEnd разработка",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.035 «Разработчик WEB и мультимедийных приложений». Вид профессиональной деятельности «Проектирование, разработка и интеграция информационных ресурсов в локальной сети и информационно-телекоммуникационной сети «Интернет»"
      },
      {
        href:
          "http://sstu.ru/upload/iblock/589/3_java_theme_12_09.1ee91676df034216919b0affee7d3c1e.jpg",
        title: "Разработка баз данных и клиент-серверных приложений",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.015 «Специалист по информационным системам». Вид профессиональной деятельности «Поддержание эффективной работы баз данных, обеспечивающих функционирование информационных систем в организации»"
      },
      {
        href:
          "http://nenovost.com/wp-content/uploads/2019/02/%D0%A1%D0%BE%D0%B7%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5-%D0%B8%D0%B3%D1%80%D0%BE%D0%B2%D1%8B%D1%85-%D0%BF%D1%80%D0%B8%D0%BB%D0%BE%D0%B6%D0%B5%D0%BD%D0%B8%D0%B9.jpg",
        title: "Разработка игровых приложений",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.001 «Программист». Вид профессиональной деятельности «Разработка программного обеспечения»"
      },
      {
        href: "https://fb.ru/misc/i/thumb/a/2/4/7/7/2/4/1/2477241.jpg",
        title: "Информационная безопасность компьютерных сетей",
        cost: "38 600",
        time: "250 ак. часов",
        text:
          "Программа соответствует профессиональному стандарту 06.032 «Специалист по безопасности компьютерных систем и сетей». Вид профессиональной деятельности «Защита информации в компьютерных системах и сетях»"
      }
    ]
  }),
  components:{
    "retraining":Retraining 
  }
};
</script>